pmo-dataset/graphviz/29.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "StartNoneEvent" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Check requirements\nand point for\nskilled workers in\nshortage occupations";
  "ExclusiveGateway_1" -> "Check requirements\nand point for\nparticularly highly\nqualified people";
  "ExclusiveGateway_1" -> "Check requirements\nand point for other\nkey employees";
  "ExclusiveGateway_1" -> "Check requirements\nand point for\nstart-up founders";
  "Check requirements\nand point for\nskilled workers in\nshortage occupations" -> "Fullfiles the\nrequirements or\npoint?";
  "Check requirements\nand point for\nparticularly highly\nqualified people" -> "Fullfiles the\nrequirements or\npoint?";
  "Check requirements\nand point for other\nkey employees" -> "Fullfiles the\nrequirements or\npoint?";
  "Check requirements\nand point for\nstart-up founders" -> "Fullfiles the\nrequirements or\npoint?";
  "Check requirements\nfor independent key\nemployees" -> "Fullfiles the\nrequirements or\npoint?";
  "Fullfiles the\nrequirements or\npoint?" -> "ExclusiveGateway_1" [label="No"];
  "Check if passport is\nup to date" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "ExclusiveGateway_3" [label="Yes"];
  "Request new passport" -> "ExclusiveGateway_3";
  "Prepare Documents\nfor r-w-r card" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Check if passport is\nup to date";
  "ParallelGateway_1" -> "Make passport photo";
  "ParallelGateway_1" -> "Prepare birth\ncertificate";
  "Search and find\nsuited apartment" -> "Negotiate rent with\nlandlord";
  "ExclusiveGateway_4" -> "Search and find\nsuited apartment";
  "ParallelGateway_1" -> "ExclusiveGateway_4";
  "Negotiate rent with\nlandlord" -> "Negotitation\nsuccessful?";
  "Negotitation\nsuccessful?" -> "ExclusiveGateway_4" [label="No"];
  "Negotitation\nsuccessful?" -> "Sign contract" [label="Yes"];
  "ParallelGateway_1" -> "Gather documentation\nto prove financial\nindepence";
  "ParallelGateway_1" -> "Application for a\nresidence permit";
  "Make passport photo" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "ParallelGateway_2";
  "Prepare birth\ncertificate" -> "ParallelGateway_2";
  "Gather documentation\nto prove financial\nindepence" -> "ParallelGateway_2";
  "Application for a\nresidence permit" -> "ParallelGateway_2";
  "Sign contract" -> "ParallelGateway_2";
  "ExclusiveGateway_5" -> "Prepare Documents\nfor r-w-r card";
  "ExclusiveGateway_2" -> "Request new passport" [label="No"];
  "ParallelGateway_1" -> "Request Austrian\nhealth insurance\ncoverage incl.\ndocumentation";
  "Request Austrian\nhealth insurance\ncoverage incl.\ndocumentation" -> "ParallelGateway_2";
  "Send documentation\nto relevant agency" -> "Rules engine\nautomaticly checks\nif documentations\nfullfilles\nrequirements";
  "Rules engine\nautomaticly checks\nif documentations\nfullfilles\nrequirements" -> "Additional\ndocumentation\nneeded?";
  "Bank Systems creates\nbank account and\nsends E-Mail\nconfirmation" -> "ExclusiveGateway_6";
  "ExclusiveGateway_6" -> "EndNoneEvent";
  "ParallelGateway_2" -> "Send documentation\nto relevant agency";
  "Additional\ndocumentation\nneeded?" -> "Agency approves\nright to stay?" [label="No"];
  "Additional\ndocumentation\nneeded?" -> "ExclusiveGateway_5" [label="Yes"];
  "Request Bank Account\non Bank website" -> "Bank Systems creates\nbank account and\nsends E-Mail\nconfirmation";
  "Agency approves\nright to stay?" -> "Request Bank Account\non Bank website" [label="Yes"];
  "Agency approves\nright to stay?" -> "ExclusiveGateway_6" [label="No"];
  "Fullfiles the\nrequirements or\npoint?" -> "ExclusiveGateway_5" [label="Yes"];
  "ExclusiveGateway_1" -> "Check requirements\nfor independent key\nemployees";
  "ExclusiveGateway_1" -> "Check requirements\nfor Graduates of an\nAustrian higher\neducation\ninstitution";
  "Check requirements\nfor Graduates of an\nAustrian higher\neducation\ninstitution" -> "Fullfiles the\nrequirements or\npoint?";

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Fullfiles the\nrequirements or\npoint?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "Negotitation\nsuccessful?" [shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "Additional\ndocumentation\nneeded?" [shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "Agency approves\nright to stay?" [shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
